package org.ag.constant;

/**
 * @author johoka
 */
public enum CardEnum {
    CARD_1("花1", 1, 1),
    CARD_2("花2", 2, 2),
    CARD_3("花3", 3, 3),
    CARD_4("花4", 4, 4),
    CARD_5("花5", 5, 5),
    CARD_6("花6", 6, 6),
    CARD_7("花7", 7, 7),
    CARD_8("花8", 8, 8),
    CARD_9("花9", 9, 9),
    CARD_10("梅花10", 10, 10),
    CARD_11("梅花11", 11, 11),
    CARD_12("梅花12", 12, 12),
    CARD_13("梅花13", 13, 13),
    CARD_14("", 0, 14),
    CARD_15("", 0, 15),
    CARD_16("", 0, 16),
    CARD_17("方块1", 1, 17),
    CARD_18("方块2", 2, 18),
    CARD_19("方块3", 3, 19),
    CARD_20("方块4", 4, 20),
    CARD_21("方块5", 5, 21),
    CARD_22("方块6", 6, 22),
    CARD_23("方块7", 7, 23),
    CARD_24("方块8", 8, 24),
    CARD_25("方块9", 9, 25),
    CARD_26("方块10", 10, 26),
    CARD_27("方块11", 11, 27),
    CARD_28("方块12", 12, 28),
    CARD_29("方块13", 13, 29),
    CARD_30("", 0, 30),
    CARD_31("", 1, 31),
    CARD_32("", 2, 32),
    CARD_33("黑桃1", 1, 33),
    CARD_34("黑桃2", 2, 34),
    CARD_35("黑桃3", 3, 35),
    CARD_36("黑桃4", 4, 36),
    CARD_37("黑桃5", 5, 37),
    CARD_38("黑桃6", 6, 38),
    CARD_39("黑桃7", 7, 39),
    CARD_40("黑桃8", 8, 40),
    CARD_41("黑桃9", 9, 41),
    CARD_42("黑桃10", 10, 42),
    CARD_43("黑桃11", 11, 43),
    CARD_44("黑桃12", 12, 44),
    CARD_45("黑桃13", 13, 45),
    CARD_46("", 0, 46),
    CARD_47("", 0, 47),
    CARD_48("", 0, 48),
    CARD_49("红桃1", 1, 49),
    CARD_50("红桃2", 2, 50),
    CARD_51("红桃3", 3, 51),
    CARD_52("红桃4", 4, 52),
    CARD_53("红桃5", 5, 53),
    CARD_54("红桃6", 6, 54),
    CARD_55("红桃7", 7, 55),
    CARD_56("红桃8", 8, 56),
    CARD_57("红桃9", 9, 57),
    CARD_58("红桃10", 10, 58),
    CARD_59("红桃11", 11, 59),
    CARD_60("红桃12", 12, 60),
    CARD_61("红桃13", 13, 61),
    CARD_62("", 0, 62),
    CARD_63("", 0, 63),
    CARD_64("", 0, 64);

    private String desc;
    private int cardNum;
    private int num;

    CardEnum(String desc, int cardNum, int num) {
        this.desc = desc;
        this.cardNum = cardNum;
        this.num = num;
    }
}
